In [11]:
import pandas as pd
import numpy as np
import seaborn as sns
from scripts.project_functions import *

In [14]:
# Initial dataframe import

df = process_data('../../data/raw/adult.data')

In [15]:
# Initial dataframe visualization

print("Number of rows, columns: {}".format(df.shape))
df.head()

Number of rows, columns: (32561, 11)

,Age,Workclass,Education,Marital Status,Occupation,Relationship,Race,Sex,Hours per Week,Native Country,Salary
0,39,State-gov,Bachelors,Never-married,Adm-clerical,Not-in-family,White,Male,40,United-States,<=50K
1,50,Self-emp-not-inc,Bachelors,Married-civ-spouse,Exec-managerial,Husband,White,Male,13,United-States,<=50K
2,38,Private,HS-grad,Divorced,Handlers-cleaners,Not-in-family,White,Male,40,United-States,<=50K
3,53,Private,11th,Married-civ-spouse,Handlers-cleaners,Husband,Black,Male,40,United-States,<=50K
4,28,Private,Bachelors,Married-civ-spouse,Prof-specialty,Wife,Black,Female,40,Cuba,<=50K

In [16]:
# Viewing numerical column data basic statistics

pd.options.display.float_format = "{:.1f}".format
df.describe()

          Age  Hours per Week
count 32561.0         32561.0
mean     38.6            40.4
std      13.6            12.3
min      17.0             1.0
25%      28.0            40.0
50%      37.0            40.0
75%      48.0            45.0
max      90.0            99.0

In [8]:
# Number of unique values for each column

df.nunique(axis=0)

Age               73
Workclass          9
Education         16
Marital Status     7
Occupation        15
Relationship       6
Race               5
Sex                2
Hours per Week    94
Native Country    42
Salary             2
dtype: int64

In [10]:
# Looking at some of the columns unique variables

print("Education uniques: \n{}\n".format(df.Education.unique()))
print("Relationship uniques: \n{}\n".format(df.Relationship.unique()))
print("Occupation uniques: \n{}".format(df.Occupation.unique()))

Education uniques:
[' Bachelors' ' HS-grad' ' 11th' ' Masters' ' 9th' ' Some-college'
 ' Assoc-acdm' ' Assoc-voc' ' 7th-8th' ' Doctorate' ' Prof-school'
 ' 5th-6th' ' 10th' ' 1st-4th' ' Preschool' ' 12th']

Relationship uniques:
[' Not-in-family' ' Husband' ' Wife' ' Own-child' ' Unmarried'
 ' Other-relative']

Occupation uniques:
[' Adm-clerical' ' Exec-managerial' ' Handlers-cleaners' ' Prof-specialty'
 ' Other-service' ' Sales' ' Craft-repair' ' Transport-moving'
 ' Farming-fishing' ' Machine-op-inspct' ' Tech-support' ' ?'
 ' Protective-serv' ' Armed-Forces' ' Priv-house-serv']

In [18]:
# Reclassify condition column
def clean_education(row):
    
    DidntGrad = ['11th', '9th', '7th-8th', '5th-6th', '10th', '1st-4th', '12th']     
    
    if row.Education in DidntGrad:
        return '>Highschool'   
   
    return row.Education

def clean_df(playlist):
    df_cleaned = df.copy()
    df_cleaned['Education'] = df_cleaned.apply(lambda row: clean_education(row), axis=1)
    return df_cleaned# Get df with reclassfied 'condition' column

df_cleaned = clean_df(df)
print(df_cleaned.Education.unique())

[' Bachelors' ' HS-grad' ' 11th' ' Masters' ' 9th' ' Some-college'
 ' Assoc-acdm' ' Assoc-voc' ' 7th-8th' ' Doctorate' ' Prof-school'
 ' 5th-6th' ' 10th' ' 1st-4th' ' Preschool' ' 12th']